//gimmick_Chocoball
{
	D3DXVECTOR3(0.00f, 32.40f, -41.49f),             //平行移動
	D3DXQUATERNION(0.71, 0.00f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(1.10f, 8.70f, -3.60f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Up Floor_00
{
	D3DXVECTOR3(1.24f, 12.81f, -21.25f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	10.00f,//最大移動量
},
//Up Floor_00
{
	D3DXVECTOR3(-11.37f, 30.25f, -76.20f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	10.00f,//最大移動量
},
//Floor_01
{
	D3DXVECTOR3(23.62f, 23.68f, -99.30f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	10.00f,//最大移動量
},
//gimmick_Chocoball
{
	D3DXVECTOR3(10.49f, 31.24f, -99.40f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Up Floor_00
{
	D3DXVECTOR3(27.35f, 21.46f, -99.30f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	10.00f,//最大移動量
},
//enemy_bullet0
{
	D3DXVECTOR3(46.15f, 15.27f, -99.53f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0
{
	D3DXVECTOR3(-5.17f, 31.54f, -91.63f),             //平行移動
	D3DXQUATERNION(0.00, -0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0
{
	D3DXVECTOR3(6.54f, 31.54f, -99.28f),             //平行移動
	D3DXQUATERNION(0.00, 0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (1)
{
	D3DXVECTOR3(-8.22f, 31.54f, -61.58f),             //平行移動
	D3DXQUATERNION(0.00, 0.50f, 0.00f, 0.87f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball
{
	D3DXVECTOR3(-11.52f, 38.82f, -78.59f),             //平行移動
	D3DXQUATERNION(0.71, 0.00f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (2)
{
	D3DXVECTOR3(-4.10f, 31.54f, -55.38f),             //平行移動
	D3DXQUATERNION(0.00, 0.50f, 0.00f, 0.87f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
