//enemy_LR1
{
	D3DXVECTOR3(-0.47f, 0.99f, -10.23f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0
{
	D3DXVECTOR3(-0.47f, 0.99f, -10.23f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball0
{
	D3DXVECTOR3(-34.70f, 12.13f, -30.20f),             //平行移動
	D3DXQUATERNION(0.00, -0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.56f, 1.00f, 1.56f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball2
{
	D3DXVECTOR3(-49.06f, 22.53f, 47.07f),             //平行移動
	D3DXQUATERNION(0.18, 0.81f, -0.44f, 0.34f ),    //回転
	D3DXVECTOR3(1.01f, 1.14f, 0.89f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball1
{
	D3DXVECTOR3(-53.20f, 5.70f, -13.84f),             //平行移動
	D3DXQUATERNION(0.16, 0.84f, -0.35f, 0.39f ),    //回転
	D3DXVECTOR3(1.03f, 1.60f, 1.60f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor0
{
	D3DXVECTOR3(-51.00f, 7.65f, -15.89f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall0
{
	D3DXVECTOR3(-13.04f, 16.76f, 65.33f),             //平行移動
	D3DXQUATERNION(0.10, 0.43f, 0.07f, 0.89f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall1
{
	D3DXVECTOR3(-26.50f, 20.87f, 56.54f),             //平行移動
	D3DXQUATERNION(0.08, 0.46f, -0.10f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball3
{
	D3DXVECTOR3(-24.00f, 27.36f, 61.00f),             //平行移動
	D3DXQUATERNION(-0.45, 0.09f, -0.89f, 0.01f ),    //回転
	D3DXVECTOR3(0.86f, 0.80f, 0.72f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor1
{
	D3DXVECTOR3(-42.48f, 16.69f, 80.84f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball4
{
	D3DXVECTOR3(-22.07f, 22.83f, 93.87f),             //平行移動
	D3DXQUATERNION(-0.94, 0.02f, -0.35f, 0.01f ),    //回転
	D3DXVECTOR3(0.87f, 0.79f, 0.71f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball5
{
	D3DXVECTOR3(-30.58f, 21.45f, 85.25f),             //平行移動
	D3DXQUATERNION(-0.78, 0.04f, -0.62f, -0.06f ),    //回転
	D3DXVECTOR3(0.85f, 0.80f, 0.74f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball6
{
	D3DXVECTOR3(-40.72f, 19.93f, 84.13f),             //平行移動
	D3DXQUATERNION(-0.43, -0.46f, -0.52f, -0.57f ),    //回転
	D3DXVECTOR3(0.91f, 0.83f, 0.53f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//MoveFloor0
{
	D3DXVECTOR3(-44.06f, 16.67f, 78.50f),             //平行移動
	D3DXQUATERNION(-0.01, 0.93f, 0.02f, 0.37f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	3,//ギミックタイプ
	2.00f,//最大移動量
},
//UpFloor0
{
	D3DXVECTOR3(-42.30f, 17.63f, 71.71f),             //平行移動
	D3DXQUATERNION(0.66, 0.64f, -0.31f, -0.24f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor1
{
	D3DXVECTOR3(-45.93f, 17.32f, 69.48f),             //平行移動
	D3DXQUATERNION(0.66, 0.64f, -0.31f, -0.24f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall2
{
	D3DXVECTOR3(-49.47f, 18.32f, 70.58f),             //平行移動
	D3DXQUATERNION(0.05, 0.74f, -0.02f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall3
{
	D3DXVECTOR3(-52.82f, 17.92f, 64.47f),             //平行移動
	D3DXQUATERNION(0.05, 0.74f, -0.02f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall4
{
	D3DXVECTOR3(-54.30f, 18.18f, 66.80f),             //平行移動
	D3DXQUATERNION(0.05, 0.74f, -0.02f, -0.68f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor2
{
	D3DXVECTOR3(-59.70f, 15.53f, 67.51f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor2
{
	D3DXVECTOR3(-56.68f, 15.53f, 66.01f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	1.00f,//最大移動量
},
//UpFloor3
{
	D3DXVECTOR3(-64.42f, 3.44f, 71.18f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	25.00f,//最大移動量
},
//MoveFloor1
{
	D3DXVECTOR3(-62.13f, 32.74f, 67.97f),             //平行移動
	D3DXQUATERNION(0.66, 0.64f, -0.31f, -0.24f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	3,//ギミックタイプ
	3.00f,//最大移動量
},
//UpFloor4
{
	D3DXVECTOR3(-31.60f, 34.83f, 29.51f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor5
{
	D3DXVECTOR3(-27.50f, 34.83f, 24.91f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet0
{
	D3DXVECTOR3(-31.60f, 34.83f, 29.51f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//FireJet1
{
	D3DXVECTOR3(-27.50f, 34.83f, 24.91f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor6
{
	D3DXVECTOR3(5.87f, 23.16f, -6.11f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	10.00f,//最大移動量
},
//UpFloor7
{
	D3DXVECTOR3(7.50f, 33.50f, -8.66f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	10.00f,//最大移動量
},
//gimmick_Chocoball7
{
	D3DXVECTOR3(-15.29f, 34.90f, 5.53f),             //平行移動
	D3DXQUATERNION(-0.66, -0.31f, 0.11f, -0.67f ),    //回転
	D3DXVECTOR3(0.45f, 0.50f, 0.26f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//MoveFloor0 (1)
{
	D3DXVECTOR3(0.10f, 2.43f, -0.99f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	3,//ギミックタイプ
	2.00f,//最大移動量
},
//MoveFloor0 (2)
{
	D3DXVECTOR3(-47.20f, 16.53f, 81.81f),             //平行移動
	D3DXQUATERNION(-0.01, 0.93f, 0.02f, 0.37f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	3,//ギミックタイプ
	2.00f,//最大移動量
},
