//gimmick_Chocoball
{
	D3DXVECTOR3(0.00f, 32.40f, -41.49f),             //平行移動
	D3DXQUATERNION(0.71, 0.00f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(1.10f, 8.70f, -3.60f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Up Floor_00
{
	D3DXVECTOR3(1.10f, 12.81f, -21.25f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	10.00f,//最大移動量
},
//Floor_00
{
	D3DXVECTOR3(-11.67f, 29.50f, -76.55f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	10.00f,//最大移動量
},
//Floor_01
{
	D3DXVECTOR3(25.60f, 25.20f, -99.30f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	10.00f,//最大移動量
},
