//enemy_00
{
	D3DXVECTOR3(0.00f, 8.55f, -32.90f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_00
{
	D3DXVECTOR3(0.00f, 8.50f, -19.66f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_01
{
	D3DXVECTOR3(0.00f, 8.50f, -24.55f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_02
{
	D3DXVECTOR3(-0.40f, 18.40f, -22.70f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball_00
{
	D3DXVECTOR3(0.00f, 11.52f, -21.40f),             //平行移動
	D3DXQUATERNION(0.71, 0.00f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball_00
{
	D3DXVECTOR3(-26.06f, 19.79f, -46.10f),             //平行移動
	D3DXQUATERNION(0.00, -1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_02 (1)
{
	D3DXVECTOR3(-25.96f, 20.65f, -55.28f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball_00
{
	D3DXVECTOR3(-14.60f, 19.79f, -23.64f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, -0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball_00
{
	D3DXVECTOR3(9.01f, 19.36f, -22.82f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, -0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(-0.80f, 19.77f, -65.20f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(-11.70f, 19.65f, -74.00f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00 
{
	D3DXVECTOR3(-21.00f, 19.57f, -71.70f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0
{
	D3DXVECTOR3(-25.95f, 19.62f, -51.29f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0 (1)
{
	D3DXVECTOR3(-25.82f, 19.72f, -36.33f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
