//FallFloor_00
{
	D3DXVECTOR3(0.23f, 29.60f, -29.90f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor_01
{
	D3DXVECTOR3(0.33f, 29.67f, -9.97f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor_02
{
	D3DXVECTOR3(0.26f, 24.72f, 20.65f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	-1.00f,//最大移動量
},
//Wall_00
{
	D3DXVECTOR3(-2.73f, 30.61f, -17.23f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_01
{
	D3DXVECTOR3(-2.73f, 30.61f, 1.88f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//Chocoball_00
{
	D3DXVECTOR3(1.46f, 1.24f, 75.95f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.08f ),    //回転
	D3DXVECTOR3(1.02f, 1.00f, 1.02f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//Wall_02
{
	D3DXVECTOR3(-1.30f, 0.55f, 72.36f),             //平行移動
	D3DXQUATERNION(0.00, 0.17f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(-68.60f, 0.55f, 96.90f),             //平行移動
	D3DXQUATERNION(0.00, 0.17f, 0.00f, 0.98f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
