//enemy_LR1
{
	D3DXVECTOR3(-0.47f, 0.99f, -10.23f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_bullet0
{
	D3DXVECTOR3(-16.18f, 11.40f, -28.98f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.66f, 1.33f, 1.66f ),            //拡大
	3,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR0
{
	D3DXVECTOR3(-0.47f, 0.99f, -10.23f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.79f, 1.33f, 1.60f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball0
{

	D3DXVECTOR3(-34.70f, 12.13f, -30.20f),             //平行移動
	D3DXQUATERNION(0.00, -0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.56f, 1.00f, 1.56f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball2
{
	D3DXVECTOR3(-47.74f, 22.34f, 47.59f),             //平行移動
	D3DXQUATERNION(0.00, 0.92f, 0.00f, 0.38f ),    //回転
	D3DXVECTOR3(1.27f, 1.14f, 1.31f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball1
{
	D3DXVECTOR3(-52.53f, 5.70f, -12.37f),             //平行移動
	D3DXQUATERNION(0.00, 0.92f, 0.00f, 0.38f ),    //回転
	D3DXVECTOR3(1.27f, 1.14f, 1.31f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor0
{

	D3DXVECTOR3(-50.50f, 6.80f, -14.00f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall0
{
	D3DXVECTOR3(-13.04f, 16.76f, 65.33f),             //平行移動
	D3DXQUATERNION(0.10, 0.43f, 0.07f, 0.89f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//ChocoWall1
{
	D3DXVECTOR3(-26.50f, 20.87f, 56.54f),             //平行移動
	D3DXQUATERNION(0.08, 0.46f, -0.10f, 0.88f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	1,//ギミックタイプ
	0.00f,//最大移動量
},
//gimmick_Chocoball2
{
	D3DXVECTOR3(-47.74f, 22.34f, 47.59f),             //平行移動
	D3DXQUATERNION(0.00, 0.92f, 0.00f, 0.38f ),    //回転
	D3DXVECTOR3(1.28f, 1.14f, 1.32f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//MoveFloor_00
{
	D3DXVECTOR3(-0.01f, 1.62f, 4.18f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//UpFloor0
{
	D3DXVECTOR3(-57.29f, 7.75f, -8.60f),             //平行移動
	D3DXQUATERNION(0.00, 0.38f, 0.00f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	4,//ギミックタイプ
	1.00f,//最大移動量
},
//FireJet0
{
	D3DXVECTOR3(-67.25f, 11.70f, -1.96f),             //平行移動
	D3DXQUATERNION(0.03, 0.39f, 0.04f, 0.92f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	5,//ギミックタイプ
	0.00f,//最大移動量
},
