//gimmick_Chocoball
{
	D3DXVECTOR3(0.00f, 0.00f, -10.00f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR_00
{
	D3DXVECTOR3(0.00f, 0.80f, -5.00f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	0,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR_01
{
	D3DXVECTOR3(-26.34f, 11.75f, 25.96f),             //平行移動
	D3DXQUATERNION(0.00, 1.00f, 0.00f, 0.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_LR_02
{
	D3DXVECTOR3(-26.34f, 11.75f, 26.95f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//FallFloor_00 (1)
{
	D3DXVECTOR3(-24.15f, 26.97f, 25.48f),             //平行移動
	D3DXQUATERNION(0.00, -0.71f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(3.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	3,//ギミックタイプ
	3.00f,//最大移動量
},
