//gimmick_Chocoball_00
{
	D3DXVECTOR3(0.00f, 11.52f, -21.40f),             //平行移動
	D3DXQUATERNION(0.71, 0.00f, 0.00f, 0.71f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	0,//ギミックタイプ
	0.00f,//最大移動量
},
//enemy_00
{
	D3DXVECTOR3(0.00f, 10.00f, -29.70f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	2,//エネミータイプ
	-1,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_00
{
	D3DXVECTOR3(0.00f, 8.50f, -19.66f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_01
{
	D3DXVECTOR3(0.00f, 8.50f, -24.55f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
//Fall_Floor_02
{
	D3DXVECTOR3(-0.40f, 18.40f, -22.70f),             //平行移動
	D3DXQUATERNION(0.00, 0.00f, 0.00f, 1.00f ),    //回転
	D3DXVECTOR3(1.00f, 1.00f, 1.00f ),            //拡大
	-1,//エネミータイプ
	2,//ギミックタイプ
	0.00f,//最大移動量
},
